Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: فإن تولوا فقل آذنتكم على سواء وإن أدري أقريب أم بعيد ما توعدون
en: But if they (disbelievers, idolaters, Jews, Christians, polytheists) turn away (from Islamic Monotheism) say (to them O Muhammad صلى الله عليه وسلم): "I give you a notice (of war as) to be known to us all alike. And I know not whether that which you are promised (i.e. the torment or the Day of Resurrection) is near or far. "

source: إنه يعلم الجهر من القول ويعلم ما تكتمون
en: (Say O Muhammad صلى الله عليه وسلم): Verily, He (Allah) knows that which is spoken aloud (openly) and that which you conceal.

source: وإن أدري لعله فتنة لكم ومتاع إلى حين
en: And I know not, perhaps it may be a trial for you, and an enjoyment for a while.

source: قال رب احكم بالحق وربنا الرحمن المستعان على ما تصفون
en: He (Muhammad صلى الله عليه وسلم) said: "My Lord! Judge You in truth! Our Lord is the Most Gracious, Whose Help is to be sought against that which you attribute (unto Allah that He has offspring, and unto Muhammad صلى الله عليه وسلم that he is a sorcerer, and unto the Qur'an that it is poetry)!"

source: يا أيها الناس اتقوا ربكم إن زلزلة الساعة شيء عظيم
en: O mankind! Fear your Lord and be dutiful to Him! Verily, the earthquake of the Hour (of Judgement) is a terrible thing.

source: يوم ترونها تذهل كل مرضعة عما أرضعت وتضع كل ذات حمل حملها وترى الناس سكارى وما هم بسكارى ولكن عذاب الله شديد
en: The Day you shall see it, every nursing mother will forget her nursling, and every pregnant one will drop her load, and you shall see mankind as in a drunken state, yet they will not be drunken, but severe will be the Torment of Allah.

source: ومن الناس من يجادل في الله بغير علم ويتبع كل شيطان مريد
en: And among mankind is he who disputes concerning Allah, without knowledge, and follows every rebellious (disobedient to Allah) Shaitan (devil) (devoid of every kind of good).

source: كتب عليه أنه من تولاه فأنه يضله ويهديه إلى عذاب السعير
en: For him (the devil) it is decreed that whosoever follows him, he will mislead him, and will drive him to the torment of the Fire. [Tafsir At-Tabari]

source: يا أيها الناس إن كنتم في ريب من البعث فإنا خلقناكم من تراب ثم من نطفة ثم من علقة ثم من مضغة مخلقة وغير مخلقة لنبين لكم ونقر في الأرحام ما نشاء إلى أجل مسمى ثم نخرجكم طفلا ثم لتبلغوا أشدكم ومنكم من يتوفى ومنكم من يرد إلى أرذل العمر لكيلا يعلم من بعد علم شيئا وترى الأرض هامدة فإذا أنزلنا عليها الماء اهتزت وربت وأنبتت من كل زوج بهيج
en: O mankind! If you are in doubt about the Resurrection, then verily We have created you (i.e. Adam) from dust, then from a Nutfah (mixed drops of male and female sexual discharge i.e. the offspring of Adam), then from a clot (a piece of thick coagulated blood) then from a little lump of flesh - some formed and some unformed (as in the case of miscarriage) - that We may make (it) clear to you (i.e. to show you Our Power and Ability to do what We will). And We cause whom We will to remain in the wombs for an appointed term, then We bring you out as infants, then (give you growth) that you may reach your age of full strength. And among you there is he who dies (young), and among you there is he who is brought back to the miserable old age, so that he knows nothing after having known. And you see the earth barren, but when We send down water (rain) on it, it is stirred (to life), and it swells and puts forth every lovely kind (of growth).

source: ذلك بأن الله هو الحق وأنه يحيي الموتى وأنه على كل شيء قدير
en: That is because Allah: He is the Truth, and it is He Who gives life to the dead, and it is He Who is Able to do all things.

source: وأن الساعة آتية لا ريب فيها وأن الله يبعث من في القبور
en: And surely, the Hour is coming, there is no doubt about it; and certainly, Allah will resurrect those who are in the graves.

source: ومن الناس من يجادل في الله بغير علم ولا هدى ولا كتاب منير
en: And among men is he who disputes about Allah, without knowledge or guidance, or a Book giving light (from Allah),

source: ثاني عطفه ليضل عن سبيل الله له في الدنيا خزي ونذيقه يوم القيامة عذاب الحريق
en: Bending his neck in pride (far astray from the Path of Allah), and leading (others) too (far) astray from the Path of Allah. For him there is disgrace in this worldly life, and on the Day of Resurrection We shall make him taste the torment of burning (Fire).

source: ذلك بما قدمت يداك وأن الله ليس بظلام للعبيد
en: That is because of what your hands have sent forth, and verily, Allah is not unjust to (His) slaves.

source: ومن الناس من يعبد الله على حرف فإن أصابه خير اطمأن به وإن أصابته فتنة انقلب على وجهه خسر الدنيا والآخرة ذلك هو الخسران المبين
en: And among mankind is he who worships Allah as it were, upon the edge (i.e. in doubt): if good befalls him, he is content therewith; but if a trial befalls him, he turns back on his face (i.e. reverts to disbelief after embracing Islam). He loses both this world and the Hereafter. That is the evident loss.

source: يدعو من دون الله ما لا يضره وما لا ينفعه ذلك هو الضلال البعيد
en: He calls besides Allah unto that which can neither harm him, nor profit him. That is a straying far away.

source: يدعو لمن ضره أقرب من نفعه لبئس المولى ولبئس العشير
en: He calls unto him whose harm is nearer than his profit: certainly, an evil Maula (patron) and certainly an evil friend!

source: إن الله يدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار إن الله يفعل ما يريد
en: Truly, Allah will admit those who believe (in Islamic Monotheism) and do righteous good deeds (according to the Qur'an and the Sunnah) to Gardens underneath which rivers flow (in Paradise). Verily, Allah does what He wills.

source: من كان يظن أن لن ينصره الله في الدنيا والآخرة فليمدد بسبب إلى السماء ثم ليقطع فلينظر هل يذهبن كيده ما يغيظ
en: Whoever thinks that Allah will not help him (Muhammad صلى الله عليه وسلم) in this world and in the Hereafter, let him stretch out a rope to the ceiling and let him strangle himself. Then let him see whether his plan will remove that whereat he rages!

source: وكذلك أنزلناه آيات بينات وأن الله يهدي من يريد
en: Thus have We sent it (this Qur'an) down (to Muhammad صلى الله عليه وسلم) as clear signs, evidence and proofs, and surely, Allah guides whom He wills.

source: إن الذين آمنوا والذين هادوا والصابئين والنصارى والمجوس والذين أشركوا إن الله يفصل بينهم يوم القيامة إن الله على كل شيء شهيد
en: Verily, those who believe (in Allah and in His Messenger Muhammad صلى الله عليه وسلم), and those who are Jews, and the Sabians, and the Christians, and the Majus, and those who worship others besides Allah, truly, Allah will judge between them on the Day of Resurrection. Verily! Allah is over all things a Witness.

source: ألم تر أن الله يسجد له من في السماوات ومن في الأرض والشمس والقمر والنجوم والجبال والشجر والدواب وكثير من الناس وكثير حق عليه العذاب ومن يهن الله فما له من مكرم إن الله يفعل ما يشاء
en: See you not that whoever is in the heavens and whoever is on the earth, and the sun, and the moon, and the stars, and the mountains, and the trees, and Ad-Dawabb [moving (living) creatures, beasts], and many of mankind prostrate themselves to Allah. But there are many (men) on whom the punishment is justified. And whomsoever Allah disgraces, none can honour him. Verily, Allah does what He wills.

source: هذان خصمان اختصموا في ربهم فالذين كفروا قطعت لهم ثياب من نار يصب من فوق رءوسهم الحميم
en: These two opponents (believers and disbelievers) dispute with each other about their Lord: then as for those who disbelieved, garments of fire will be cut out for them, boiling water will be poured down over their heads.

source: يصهر به ما في بطونهم والجلود
en: With it will melt (or vanish away) what is within their bellies, as well as (their) skins.

source: ولهم مقامع من حديد
en: And for them are hooked rods of iron (to punish them).

source: كلما أرادوا أن يخرجوا منها من غم أعيدوا فيها وذوقوا عذاب الحريق
en: Every time they seek to get away therefrom, from anguish, they will be driven back therein, and (it will be) said to them: "Taste the torment of burning!"

source: إن الله يدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار يحلون فيها من أساور من ذهب ولؤلؤا ولباسهم فيها حرير
en: Truly, Allah will admit those who believe (in the Oneness of Allah - Islamic Monotheism) and do righteous good deeds, to Gardens underneath which rivers flow (in Paradise), wherein they will be adorned with bracelets of gold and pearls and their garments therein will be of silk.

source: وهدوا إلى الطيب من القول وهدوا إلى صراط الحميد
en: And they are guided (in this world) unto goodly speech (i.e. La ilaha illallah, Alhamdu lillah, recitation of the Qur'an, etc.) and they are guided to the Path of Him (i.e. Allah's religion of Islamic Monotheism), Who is Worthy of all praises.

source: إن الذين كفروا ويصدون عن سبيل الله والمسجد الحرام الذي جعلناه للناس سواء العاكف فيه والباد ومن يرد فيه بإلحاد بظلم نذقه من عذاب أليم
en: Verily, those who disbelieved and hinder (men) from the Path of Allah, and from Al-Masjid-al-Haram (at Makkah) which We have made (open) to (all) men, the dweller in it and the visitor from the country are equal there [as regards its sanctity and pilgrimage (Hajj and 'Umrah)] - and whoever inclines to evil actions therein or to do wrong (i.e. practise polytheism and leave Islamic Monotheism), him We shall cause to taste from a painful torment.

source: وإذ بوأنا لإبراهيم مكان البيت أن لا تشرك بي شيئا وطهر بيتي للطائفين والقائمين والركع السجود
en: And (remember) when We showed Ibrahim (Abraham) the site of the (Sacred) House (the Ka'bah at Makkah) (saying): "Associate not anything (in worship) with Me, [La ilaha illallah (none has the right to be worshipped but Allah) - Islamic Monotheism], and sanctify My House for those who circumambulate it, and those who stand up (for prayer), and those who bow (submit themselves with humility and obedience to Allah), and make prostration (in prayer);"

source: وأذن في الناس بالحج يأتوك رجالا وعلى كل ضامر يأتين من كل فج عميق
en: And proclaim to mankind the Hajj (pilgrimage). They will come to you on foot and on every lean camel, they will come from every deep and distant (wide) mountain highway (to perform Hajj ).

source: ليشهدوا منافع لهم ويذكروا اسم الله في أيام معلومات على ما رزقهم من بهيمة الأنعام فكلوا منها وأطعموا البائس الفقير
en: That they may witness things that are of benefit to them (i.e. reward of Hajj in the Hereafter, and also some worldly gain from trade), and mention the Name of Allah on appointed days (i.e. 10th, 11th, 12th, and 13th day of Dhul-Hijjah), over the beast of cattle that He has provided for them (for sacrifice), [at the time of their slaughtering by saying: (Bismillah, Wallahu-Akbar, Allahumma Minka wa Ilaik).] Then eat thereof and feed therewith the poor having a hard time.

source: ثم ليقضوا تفثهم وليوفوا نذورهم وليطوفوا بالبيت العتيق
en: Then let them complete their prescribed duties (Manasik of Hajj) and perform their vows, and circumambulate the Ancient House (the Ka'bah at Makkah).

source: ذلك ومن يعظم حرمات الله فهو خير له عند ربه وأحلت لكم الأنعام إلا ما يتلى عليكم فاجتنبوا الرجس من الأوثان واجتنبوا قول الزور
en: That (Manasik- prescribed duties of Hajj is the obligation that mankind owes to Allah), and whoever honours the sacred things of Allah, then that is better for him with his Lord. The cattle are lawful to you, except those (that will be) mentioned to you (as exceptions). So shun the abomination (worshipping) of idol, and shun lying speech (false statements) -

source: حنفاء لله غير مشركين به ومن يشرك بالله فكأنما خر من السماء فتخطفه الطير أو تهوي به الريح في مكان سحيق
en: Hunafa' Lillah (i.e. worshiping none but Allah), not associating partners (in worship) unto Him; and whoever assigns partners to Allah, it is as if he had fallen from the sky, and the birds had snatched him, or the wind had thrown him to a far off place.

source: ذلك ومن يعظم شعائر الله فإنها من تقوى القلوب
en: Thus it is [what has been mentioned in the above said Verses (27, 28, 29, 30, 31) is an obligation that mankind owes to Allah] and whosoever honours the Symbols of Allah, then it is truly from the piety of the hearts.

source: لكم فيها منافع إلى أجل مسمى ثم محلها إلى البيت العتيق
en: In them (cattle offered for sacrifice) are benefits for you for an appointed term, and afterwards they are brought for sacrifice unto the ancient House (the Haram - sacred territory of Makkah).

source: ولكل أمة جعلنا منسكا ليذكروا اسم الله على ما رزقهم من بهيمة الأنعام فإلهكم إله واحد فله أسلموا وبشر المخبتين
en: And for every nation We have appointed religious ceremonies, that they may mention the Name of Allah over the beast of cattle that He has given them for food. And your Ilah (God) is One Ilah (God - Allah), so you must submit to Him Alone (in Islam). And (O Muhammad صلى الله عليه وسلم) give glad tidings to the Mukhbitun (those who obey Allah with humility and are humble from among the true believers of Islamic Monotheism),

source: الذين إذا ذكر الله وجلت قلوبهم والصابرين على ما أصابهم والمقيمي الصلاة ومما رزقناهم ينفقون
en: Whose hearts are filled with fear when Allah is mentioned and As-Sabirun [who patiently bear whatever may befall them (of calamities)]; and who perform As-Salat (Iqamat-as-Salat), and who spend (in Allah's Cause) out of what We have provided them.

source: والبدن جعلناها لكم من شعائر الله لكم فيها خير فاذكروا اسم الله عليها صواف فإذا وجبت جنوبها فكلوا منها وأطعموا القانع والمعتر كذلك سخرناها لكم لعلكم تشكرون
en: And the Budn (cows, oxen, or camels driven to be offered as sacrifices by the pilgrims at the sanctuary of Makkah) We have made them for you as among the Symbols of Allah, wherein you have much good. So mention the Name of Allah over them when they are drawn up in lines (for sacrifice). Then, when they are down on their sides (after slaughter), eat thereof, and feed the poor who does not ask (men), and the beggar who asks (men). Thus have We made them subject to you that you may be grateful.

source: لن ينال الله لحومها ولا دماؤها ولكن يناله التقوى منكم كذلك سخرها لكم لتكبروا الله على ما هداكم وبشر المحسنين
en: It is neither their meat nor their blood that reaches Allah, but it is piety from you that reaches Him. Thus have We made them subject to you that you may magnify Allah for His Guidance to you. And give glad tidings (O Muhammad صلى الله عليه وسلم) to the Muhsinun (doers of good).

source: إن الله يدافع عن الذين آمنوا إن الله لا يحب كل خوان كفور
en: Truly, Allah defends those who believe. Verily, Allah likes not any treacherous ingrate to Allah [those who disobey Allah but obey Shaitan (Satan)].

source: أذن للذين يقاتلون بأنهم ظلموا وإن الله على نصرهم لقدير
en: Permission to fight (against disbelievers) is given to those (believers) who are fought against, because they have been wronged; and surely, Allah is Able to give them (believers) victory -

source: الذين أخرجوا من ديارهم بغير حق إلا أن يقولوا ربنا الله ولولا دفع الله الناس بعضهم ببعض لهدمت صوامع وبيع وصلوات ومساجد يذكر فيها اسم الله كثيرا ولينصرن الله من ينصره إن الله لقوي عزيز
en: Those who have been expelled from their homes unjustly only because they said: "Our Lord is Allah." For had it not been that Allah checks one set of people by means of another, monasteries, churches, synagogues, and mosques, wherein the Name of Allah is mentioned much would surely have been pulled down. Verily, Allah will help those who help His (Cause). Truly, Allah is All-Strong, All-Mighty.

source: الذين إن مكناهم في الأرض أقاموا الصلاة وآتوا الزكاة وأمروا بالمعروف ونهوا عن المنكر ولله عاقبة الأمور
en: Those (Muslim rulers) who, if We give them power in the land, (they) enjoin Iqamat-as-Salat [i.e. to perform the five compulsory congregational Salat (prayers) (the males in mosques)], to pay the Zakat and they enjoin Al-Ma'ruf (i.e. Islamic Monotheism and all that Islam orders one to do), and forbid Al-Munkar (i.e. disbelief, polytheism and all that Islam has forbidden) [i.e. they make the Qur'an as the law of their country in all the spheres of life]. And with Allah rests the end of (all) matters (of creatures).

source: وإن يكذبوك فقد كذبت قبلهم قوم نوح وعاد وثمود
en: And if they belie you (O Muhammad صلى الله عليه وسلم), so did belie before them, the people of Nuh (Noah), 'Ad and Thamud, (their Prophets).

source: وقوم إبراهيم وقوم لوط
en: And the people of Ibrahim (Abraham) and the people of Lut (Lot),

source: وأصحاب مدين وكذب موسى فأمليت للكافرين ثم أخذتهم فكيف كان نكير
en: And the dwellers of Madyan (Midian); and belied was Musa (Moses). But I granted respite to the disbelievers for a while, then I seized them, and how (terrible) was My punishment (against their wrong-doing)!

source: فكأين من قرية أهلكناها وهي ظالمة فهي خاوية على عروشها وبئر معطلة وقصر مشيد
en: And many a township did We destroy while it was given to wrong-doing, so that it lies in ruins (up to this day), and (many) a deserted well and lofty castle!

source: أفلم يسيروا في الأرض فتكون لهم قلوب يعقلون بها أو آذان يسمعون بها فإنها لا تعمى الأبصار ولكن تعمى القلوب التي في الصدور
en: Have they not travelled through the land, and have they hearts wherewith to understand and ears wherewith to hear? Verily, it is not the eyes that grow blind, but it is the hearts which are in the breasts that grow blind.

source: ويستعجلونك بالعذاب ولن يخلف الله وعده وإن يوما عند ربك كألف سنة مما تعدون
en: And they ask you to hasten on the torment! And Allah fails not His Promise. And verily, a day with your Lord is as a thousand years of what you reckon.

source: وكأين من قرية أمليت لها وهي ظالمة ثم أخذتها وإلي المصير
en: And many a township did I give respite while it was given to wrong-doing. Then (in the end) I seized it (with punishment). And to Me is the (final) return (of all).

source: قل يا أيها الناس إنما أنا لكم نذير مبين
en: Say (O Muhammad صلى الله عليه وسلم): "O mankind! I am (sent) to you only as a plain warner."

source: فالذين آمنوا وعملوا الصالحات لهم مغفرة ورزق كريم
en: So those who believe (in the Oneness of Allah - Islamic Monotheism) and do righteous good deeds, for them is forgiveness and Rizqun Karim (generous provision, i.e. Paradise).

source: والذين سعوا في آياتنا معاجزين أولئك أصحاب الجحيم
en: But those who strive against Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.), to frustrate them, they will be dwellers of the Hell-fire.

source: وما أرسلنا من قبلك من رسول ولا نبي إلا إذا تمنى ألقى الشيطان في أمنيته فينسخ الله ما يلقي الشيطان ثم يحكم الله آياته والله عليم حكيم
en: Never did We send a Messenger or a Prophet before you but when he did recite the revelation or narrated or spoke, Shaitan (Satan) threw (some falsehood) in it. But Allah abolishes that which Shaitan (Satan) throws in. Then Allah establishes His Revelations. And Allah is All-Knower, All-Wise:

source: ليجعل ما يلقي الشيطان فتنة للذين في قلوبهم مرض والقاسية قلوبهم وإن الظالمين لفي شقاق بعيد
en: That He (Allah) may make what is thrown in by Shaitan (Satan) a trial for those in whose hearts is a disease (of hypocrisy and disbelief) and whose hearts are hardened. And certainly, the Zalimun (polytheists and wrong-doers) are in an opposition far-off (from the truth against Allah's Messenger and the believers).

source: وليعلم الذين أوتوا العلم أنه الحق من ربك فيؤمنوا به فتخبت له قلوبهم وإن الله لهاد الذين آمنوا إلى صراط مستقيم
en: And that those who have been given knowledge may know that it (this Qur'an) is the truth from your Lord, so that they may believe therein, and their hearts may submit to it with humility. And verily, Allah is the Guide of those who believe, to the Straight Path.

source: ولا يزال الذين كفروا في مرية منه حتى تأتيهم الساعة بغتة أو يأتيهم عذاب يوم عقيم
en: And those who disbelieved will not cease to be in doubt about it (this Qur'an) until the Hour comes suddenly upon them, or there comes to them the torment of the Day after which there will be no night (i.e. the Day of Resurrection).

source: الملك يومئذ لله يحكم بينهم فالذين آمنوا وعملوا الصالحات في جنات النعيم
en: The sovereignty on that Day will be that of Allah (the One Who has no partners). He will judge between them. So those who believed (in the Oneness of Allah - Islamic Monotheism) and did righteous good deeds will be in Gardens of delight (Paradise).

source: والذين كفروا وكذبوا بآياتنا فأولئك لهم عذاب مهين
en: And those who disbelieved and belied Our Verses (of this Qur'an), for them will be a humiliating torment (in Hell).

source: والذين هاجروا في سبيل الله ثم قتلوا أو ماتوا ليرزقنهم الله رزقا حسنا وإن الله لهو خير الرازقين
en: Those who emigrated in the Cause of Allah and after that were killed or died, surely, Allah will provide a good provision for them. And verily, it is Allah Who indeed is the Best of those who make provision.

source: ليدخلنهم مدخلا يرضونه وإن الله لعليم حليم
en: Truly, He will make them enter an entrance with which they shall be well-pleased, and verily, Allah indeed is All-Knowing, Most Forbearing.

source: ذلك ومن عاقب بمثل ما عوقب به ثم بغي عليه لينصرنه الله إن الله لعفو غفور
en: That is so. And whoever has retaliated with the like of that which he was made to suffer, and then has again been wronged, Allah will surely help him. Verily Allah indeed is Oft-Pardoning, Oft-Forgiving.

source: ذلك بأن الله يولج الليل في النهار ويولج النهار في الليل وأن الله سميع بصير
en: That is because Allah merges the night into the day, and He merges the day into the night. And verily, Allah is All-Hearer, All-Seer.

source: ذلك بأن الله هو الحق وأن ما يدعون من دونه هو الباطل وأن الله هو العلي الكبير
en: That is because Allah - He is the Truth (the only True God of all that exists, Who has no partners or rivals with Him), and what they (the polytheists) invoke besides Him, it is Batil (falsehood). And verily, Allah - He is the Most High, the Most Great.

source: ألم تر أن الله أنزل من السماء ماء فتصبح الأرض مخضرة إن الله لطيف خبير
en: See you not that Allah sends down water (rain) from the sky, and then the earth becomes green? Verily, Allah is the Most Kind and Courteous, Well-Acquainted with all things.

source: له ما في السماوات وما في الأرض وإن الله لهو الغني الحميد
en: To Him belongs all that is in the heavens and all that is on the earth. And verily, Allah - He is Rich (Free of all needs), Worthy of all praise.

source: ألم تر أن الله سخر لكم ما في الأرض والفلك تجري في البحر بأمره ويمسك السماء أن تقع على الأرض إلا بإذنه إن الله بالناس لرءوف رحيم
en: See you not that Allah has subjected to you (mankind) all that is on the earth, and the ships that sail through the sea by His Command? He withholds the heaven from falling on the earth except by His Leave. Verily, Allah is, for mankind, Full of Kindness, Most Merciful.

source: وهو الذي أحياكم ثم يميتكم ثم يحييكم إن الإنسان لكفور
en: It is He, Who gave you life, and then will cause you to die, and will again give you life (on the Day of Resurrection). Verily man is indeed an ingrate.

source: لكل أمة جعلنا منسكا هم ناسكوه فلا ينازعنك في الأمر وادع إلى ربك إنك لعلى هدى مستقيم
en: For every nation We have ordained religious ceremonies [e.g. slaughtering of the cattle during the three days of stay at Mina (Makkah) during the Hajj (pilgrimage)] which they must follow; so let them (the pagans) not dispute with you on the matter (i.e. to eat of the cattle which you slaughter, and not to eat of the cattle which Allah kills by its natural death), but invite them to your Lord. Verily you (O Muhammad صلى الله عليه وسلم) indeed are on the (true) straight guidance (i.e. the true religion of Islamic Monotheism).

source: وإن جادلوك فقل الله أعلم بما تعملون
en: And if they argue with you (as regards the slaughtering of the sacrifices), say "Allah knows best of what you do.

source: الله يحكم بينكم يوم القيامة فيما كنتم فيه تختلفون
en: "Allah will judge between you on the Day of Resurrection about that wherein you used to differ."
